source/org_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.org
#+BEGIN_HTML
---
layout: post
title: "Fast Rich Client Rails Development with Webpack and the ES6 Transpiler"
date: 2014-10-03
redirect_from: /blog/2014/10/02/integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project/index.html
comments: true
categories: [webpack, client-ui]
keywords: 
description: This article shows you how to integrate webpack into the Rails ecosystem, allowing the use of npm modules and tools, including the ES6 and JSX transpilers.
published: true
---
#+END_HTML

/There has to be a better way to incorporate the JavaScript ecosystem into Rails./

[[http://webpack.github.io/][{% img /images/2014-09-react-webpack-rails-tutorial/baby-bottle-of-gemified-javascript.jpg %}]]

*Update October, 21 2015*: We're about to release 1.0 of the [[https://rubygems.org/gems/react_on_rails][react_on_rails]] gem!
It will include a generator which will make the setup of this process super
easy!

*Update September, 28 2015*: Be sure to see
https://github.com/shakacode/react_on_rails/ and the [[https://rubygems.org/gems/react_on_rails][gem react_on_rails]]. My team
is writing a gem to make the process of integrating react and webpack with Rails
much easier. This also supports server rendering of react components, as well as
advanced react techniques such as REDUX.

*Update August 19, 2015*: I'm working on revising this article to reflect much
progress in this area since the original publication of this article in 2014. I
highly recommend seeing the README at
https://github.com/justin808/react-webpack-rails-tutorial and the pull requests
(both [[https://github.com/justin808/react-webpack-rails-tutorial/pulls][open]] and [[https://github.com/shakacode/react-webpack-rails-tutorial/pulls?utf8=%25E2%259C%2593&q=is%253Apr+is%253Aclosed+][closed]]) of what's been incorporated since this article was first published.

Have you:
1. Wondered if there's a better way to utilize modern JavaScript client frameworks
   the context of an existing Ruby on Rails project?
2. Gotten confused about how to integrate JavaScript libraries and examples that
   are packaged up into proper "modules"?
3. Discovered the drawbacks of having all applications JavaScript littering the
   global name-space.
4. Heard about [[http://www.slideshare.net/domenicdenicola/es6-the-awesome-parts][ES6 (aka Harmony)]], the next version of JavaScript and how the
   cool kids in Silicon Valley (Facebook, Instagram, Square, etc.) are using ES6
   syntax?
   
How would you like to achieve, within a Rails project:
1. The ability to prototype a rich UI, seeing changes in JS and CSS/Sass code
   almost instantly after hitting save, /without the page reloading/.
2. First class citizenship for utilizing the *Node ecosystem*, by specifying
   dependencies in =package.json=, running =npm install=, and then simply requiring
   modules in JavaScript files.
3. Seamless integration of Node based JavaScript assets for the Rails Asset
   Pipeline, thus *not circumventing* the asset pipeline, but co-existing with
   it and leveraging it.
4. The ability to plug the node client side ecosystem into an existing Rails project seamlessly.
5. Utilization of many JavaScript tools, such as the *React JSX tranpiler* and *ES6 transpiler*.

This article will show you how you can utilize Webpack in your Rails development
process to achieve these goals!

#+begin_html
<!-- more -->
#+end_html

First, I'm going to tell you a brief story of how I came to the realization that
/there had to be a better way to incorporate JavaScript ecosystem into Rails/.

* What's Wrong with Copying and Pasting Tons of JavaScript into /vendor/assets/javascripts?
Imagine doing Ruby on Rails projects without [[http://bundler.io/][Bundler]]? Oh, the horror! Well
that's what copying tidbits of JavaScript into =/vendor/assets/javascripts= is
like! It's actually a bit worse than that, as many of these JavaScript libraries
depend on either [[http://requirejs.org/][AMD (aka require.js)]] or [[http://wiki.commonjs.org/wiki/Modules/1.1][CommonJs module syntax]] being available.
(For a great explanation of how these module systems work, see [[http://addyosmani.com/writing-modular-js/][Writing Modular JavaScript With AMD, CommonJS & ES Harmony]].) This would be much more of a
problem in the Rails community were it not for the fact that many popular
JavaScript libraries are packaged into gems, such as the [[https://github.com/rails/jquery-rails][jquery-rails gem]]. You
might think that works fine, until you start to encounter JavaScript modules
that lacked Gems. For example, you may want to start leveraging the many [[https://www.npmjs.org/][npm
packaged]] react components, such as [[https://github.com/react-bootstrap/react-bootstrap][react-bootstrap]], or you may desire to
leverage the JavaScript toolchain, such as the [[http://facebook.github.io/react/jsx-compiler.html][JSX]] and ES6 transpilers
([[https://github.com/termi/es6-transpiler][es6-transpiler]] and [[https://github.com/esnext/es6-module-transpiler][es6-module-transpiler]]).

/Thankfully, this experience has broken me away from the JavaScript baby bottle of
gemified JavaScript! You can now become a 1st class JavaScript citizen!/
[[http://webpack.github.io/][{% img /images/2014-09-react-webpack-rails-tutorial/javascript-tourists.jpg %}]]

