source/_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.html
---
layout: post
title: "Fast Rich Client Rails Development with Webpack and the ES6 Transpiler"
date: 2014-10-02 21:30:16 -1000
comments: true
categories: [webpack, client-ui]
keywords: 
description: This article shows you how to integrate webpack into the Rails ecosystem, allowing the use of npm modules and tools, including the ES6 and JSX transpilers.
published: true
canonical: https://hackhands.com/fast-rich-client-rails-development-webpack-es6-transpiler/
---

<p>
<i>There has to be a better way to incorporate the JavaScript ecosystem into Rails.</i>
</p>

<p>
<a href="http://webpack.github.io/">{% img /images/2014-09-react-webpack-rails-tutorial/baby-bottle-of-gemified-javascript.jpg %}</a>
</p>

<p>
<b>Update August 19, 2015</b>: I'm working on revising this article to reflect much
progress in this area since the original publication of this article in 2014. I
highly recommend seeing the README at
<a href="https://github.com/justin808/react-webpack-rails-tutorial">https://github.com/justin808/react-webpack-rails-tutorial</a> and the pull requests
(both <a href="https://github.com/justin808/react-webpack-rails-tutorial/pulls">open</a> and <a href="https://github.com/justin808/react-webpack-rails-tutorial/pulls?q=is%253Apr+is%253Aclosed">closed</a>) of what's been incorporated since this article was first published.
</p>

<p>
Have you:
</p>
<ol class="org-ol">
<li>Wondered if there's a better way to utilize modern JavaScript client frameworks
the context of an existing Ruby on Rails project?
</li>
<li>Gotten confused about how to integrate JavaScript libraries and examples that
are packaged up into proper "modules"?
</li>
<li>Discovered the drawbacks of having all applications JavaScript littering the
global name-space.
</li>
<li>Heard about <a href="http://www.slideshare.net/domenicdenicola/es6-the-awesome-parts">ES6 (aka Harmony)</a>, the next version of JavaScript and how the
cool kids in Silicon Valley (Facebook, Instagram, Square, etc.) are using ES6
syntax?
</li>
</ol>

<p>
How would you like to achieve, within a Rails project:
</p>
<ol class="org-ol">
<li>The ability to prototype a rich UI, seeing changes in JS and CSS/Sass code
almost instantly after hitting save, <i>without the page reloading</i>.
</li>
<li>First class citizenship for utilizing the <b>Node ecosystem</b>, by specifying
dependencies in <code>package.json</code>, running <code>npm install</code>, and then simply requiring
modules in JavaScript files.
</li>
<li>Seamless integration of Node based JavaScript assets for the Rails Asset
Pipeline, thus <b>not circumventing</b> the asset pipeline, but co-existing with
it and leveraging it.
</li>
<li>The ability to plug the node client side ecosystem into an existing Rails project seamlessly.
</li>
<li>Utilization of many JavaScript tools, such as the <b>React JSX tranpiler</b> and <b>ES6 transpiler</b>.
</li>
</ol>

<p>
This article will show you how you can utilize Webpack in your Rails development
process to achieve these goals!
</p>

<!-- more -->

<p>
First, I'm going to tell you a brief story of how I came to the realization that
<i>there had to be a better way to incorporate JavaScript ecosystem into Rails</i>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">What's Wrong with Copying and Pasting Tons of JavaScript into /vendor/assets/javascripts?</h2>
<div class="outline-text-2" id="text-1">
<p>
Imagine doing Ruby on Rails projects without <a href="http://bundler.io/">Bundler</a>? Oh, the horror! Well
that's what copying tidbits of JavaScript into <code>/vendor/assets/javascripts</code> is
like! It's actually a bit worse than that, as many of these JavaScript libraries
depend on either <a href="http://requirejs.org/">AMD (aka require.js)</a> or <a href="http://wiki.commonjs.org/wiki/Modules/1.1">CommonJs module syntax</a> being available.
(For a great explanation of how these module systems work, see <a href="http://addyosmani.com/writing-modular-js/">Writing Modular JavaScript With AMD, CommonJS &amp; ES Harmony</a>.) This would be much more of a
problem in the Rails community were it not for the fact that many popular
JavaScript libraries are packaged into gems, such as the <a href="https://github.com/rails/jquery-rails">jquery-rails gem</a>. You
might think that works fine, until you start to encounter JavaScript modules
that lacked Gems. For example, you may want to start leveraging the many <a href="https://www.npmjs.org/">npm
packaged</a> react components, such as <a href="https://github.com/react-bootstrap/react-bootstrap">react-bootstrap</a>, or you may desire to
leverage the JavaScript toolchain, such as the <a href="http://facebook.github.io/react/jsx-compiler.html">JSX</a> and ES6 transpilers
(<a href="https://github.com/termi/es6-transpiler">es6-transpiler</a> and <a href="https://github.com/esnext/es6-module-transpiler">es6-module-transpiler</a>).
</p>

<p>
<i>Thankfully, this experience has broken me away from the JavaScript baby bottle of
gemified JavaScript! You can now become a 1st class JavaScript citizen!</i>
<a href="http://webpack.github.io/">{% img /images/2014-09-react-webpack-rails-tutorial/javascript-tourists.jpg %}</a>
</p>
</div>
