source/org_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.org
** Motivation: React and ES6
My foray down the Node rabbit hole began with a desire to use the React
framework, including its JSX transpiler. In a nutshell, the [[http://facebook.github.io/react/][React library]] stands
out as *unique, innovative, and impressive*. You can simply think about the
client-side UI as a set of components that are recursively composed and which
render based on set of data that flows in one direction, from the top level
component to each of its children. For further details into the benefits of
React, see my article [[http://www.railsonmaui.com/blog/2014/09/29/react-on-rails-4-dot-2-simple-tutorial/][React on Rails Tutorial]]. For purposes of this article, you
can imagine substituting my example of using React with your favorite rich
client JavaScript framework. /I'd be thrilled if somebody would fork my project
and create a version using [[http://emberjs.com/][EmberJs]]/.

At first this mission of integrating React seemed easy, as there is a Ruby Gem,
the [[https://github.com/reactjs/react-rails][react-rails gem]], that provided a relatively painless mechanism of
integrating react into a Rails project. This is definitely the simplest method.
I've created a tutorial, [[http://www.railsonmaui.com/blog/2014/09/29/react-on-rails-4-dot-2-simple-tutorial/][React on Rails Tutorial]], with a companion github
repository, [[https://github.com/justin808/react-rails-tutorial/commits/react][justin808/react-rails-tutorial]], that walks you through using the
=react-rails= gem with the [[http://guides.rubyonrails.org/command_line.html#rails-generate][Rails 4.2 scaffold generator]]. Then I wanted to plug
in the [[https://github.com/react-bootstrap/react-bootstrap][react-bootstrap]] library. With no gem available, I considered manually
copy-pasting the source to my =/vendor/assets/javascripts= directory, but that
just seemed to /smell/ for the following reasons:
1. JavaScript has a mature system for managing dependencies (packages & modules): [[https://www.npmjs.org/][npm]] (and [[http://bower.io/][bower]]).
2. Dependencies often depend on other dependencies, in both the Ruby and
   JavaScript worlds. Imagine managing Ruby dependencies by hand.
3. JavaScript modules often depend on either CommonJs or RequireJs being
   available.

(Side note: in terms of Node, a =module= is a special case of package that
JavaScript code can =require()=. For more info, see the [[https://www.npmjs.org/doc/misc/npm-faq.html][npm faq]] and [[http://stackoverflow.com/questions/20008442/difference-between-a-module-and-a-package-in-node][Stack Overflow]]).

Here's a good summary of other ways to handle the assets in a Rails app: [[http://www.codefellows.org/blog/five-ways-to-manage-front-end-assets-in-rails][Five Ways to Manage Front-End Assets in Rails]]. I briefly tried those techniques, plus
the [[https://github.com/hsume2/browserify-rails][browserify-rails]] gem. However, they seemed to conflict with the
=react-rails= gem, and if I didn't use that gem, I'd need a way to convert the
jsx into js files. This led me to try the webpack module bundler.

[[http://webpack.github.io/][{% img /images/2014-09-react-webpack-rails-tutorial/what-is-webpack.jpg %}]]

* Webpack
What's [[http://webpack.github.io/docs/what-is-webpack.html][Webpack]]?

#+begin_quote
webpack takes modules with dependencies and generates static assets representing those modules.
#+end_quote

Why did I try Webpack? It was recommended to me by [[http://2013.jsconf.eu/speakers/pete-hunt-react-rethinking-best-practices.html][Pete Hunt of the React team]].
Here's some solid reasons for "why Webpack":
1. Leverages npm (and optionally bower) for package management.
2. Supports whatever module syntax you prefer.
3. Has loaders (think pipeline), including ES6 and JSX.
4. Its Webpack Dev Server rocks for quick prototypes (Hot Module Replacement) of JS and
   CSS/Sass code.

A good place to get started with Webpack is Pete Hunt's [[https://github.com/petehunt/webpack-howto][webpack-howto]].

I initially tried the [[http://webpack.github.io/][webpack module bundler]] separate from Rails, as I wanted to
see the "hot reloading" of react code in action. You can try this sample code:
[[https://github.com/gaearon/react-tutorial-hot][react-tutorial-hot]]. [[https://github.com/webpack/docs/wiki/hot-module-replacement-with-webpack][Hot module Replacement]] changes the JS code (and possibly the
CSS) of the running code without any page refresh. Thus any data in the JS
objects sticks around! This is way cooler than [[http://livereload.com/][Live Reload]], which refreshes the
whole browser page.

Then I started using these features of Webpack:
1. [[https://github.com/shama/es6-loader][es6-loader]], which incorporates both of the [[https://github.com/termi/es6-transpiler][es6-transpiler]] and the
   [[https://github.com/esnext/es6-module-transpiler][es6-module-transpiler]]. For fun, try out the ES6 syntax with the [[http://www.es6fiddle.net/][ES6 Fiddle]].
   Here's a [[https://github.com/lukehoban/es6features][great references on ES6 features]].
2. [[https://github.com/petehunt/jsx-loader][jsx-loader]], which handles jsx files using es6.
3. Trivial integration of any additional packages available via *[[https://www.npmjs.org/][npm]]* and the
   ability to use whichever module syntax is most convenient.

As Webpack generates a "bundle" that is not necessarily minified, it would seem
that this could be incorporated into the Rails asset pipeline, and sure enough,
it can be! This is well described in this article: [[https://medium.com/brigade-engineering/setting-up-webpack-with-rails-c62aea149679][Setting Up Webpack with Rails]]
along with this example code to precompile with Webpack: [[http://www.tomdooner.com/2014/05/26/webpack.html][Webpack In The Rails Asset Pipeline]].

With the basic parts in place, I wanted achieve the following:
1. Be able to prototype client side JS using Webpack Dev Server (with hot module
   replacement), while having this same code readily available in my Rails app.
   This involves having JavaScript, Sass, and Image files commonly available to
   both Rails and the Webpack Dev Server.
2. Be able to easily deploy to Heroku.

My solution to the problem is shown in this github repo:
[[https://github.com/justin808/react-webpack-rails-tutorial][justin808/react-webpack-rails-tutorial]]. This is based on my tutorial using the
=react-rails= gem: [[https://github.com/justin808/react-rails-tutorial][Rails 4.2, React, completed tutorial]]. I will now describe
this solution in detail. 
