source/_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.html

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Motivation: React and ES6</h3>
<div class="outline-text-3" id="text-1-1">
<p>
My foray down the Node rabbit hole began with a desire to use the React
framework, including its JSX transpiler. In a nutshell, the <a href="http://facebook.github.io/react/">React library</a> stands
out as <b>unique, innovative, and impressive</b>. You can simply think about the
client-side UI as a set of components that are recursively composed and which
render based on set of data that flows in one direction, from the top level
component to each of its children. For further details into the benefits of
React, see my article <a href="http://www.railsonmaui.com/blog/2014/09/29/react-on-rails-4-dot-2-simple-tutorial/">React on Rails Tutorial</a>. For purposes of this article, you
can imagine substituting my example of using React with your favorite rich
client JavaScript framework. <i>I'd be thrilled if somebody would fork my project
and create a version using <a href="http://emberjs.com/">EmberJs</a></i>.
</p>

<p>
At first this mission of integrating React seemed easy, as there is a Ruby Gem,
the <a href="https://github.com/reactjs/react-rails">react-rails gem</a>, that provided a relatively painless mechanism of
integrating react into a Rails project. This is definitely the simplest method.
I've created a tutorial, <a href="http://www.railsonmaui.com/blog/2014/09/29/react-on-rails-4-dot-2-simple-tutorial/">React on Rails Tutorial</a>, with a companion github
repository, <a href="https://github.com/justin808/react-rails-tutorial/commits/react">justin808/react-rails-tutorial</a>, that walks you through using the
<code>react-rails</code> gem with the <a href="http://guides.rubyonrails.org/command_line.html#rails-generate">Rails 4.2 scaffold generator</a>. Then I wanted to plug
in the <a href="https://github.com/react-bootstrap/react-bootstrap">react-bootstrap</a> library. With no gem available, I considered manually
copy-pasting the source to my <code>/vendor/assets/javascripts</code> directory, but that
just seemed to <i>smell</i> for the following reasons:
</p>
<ol class="org-ol">
<li>JavaScript has a mature system for managing dependencies (packages &amp; modules): <a href="https://www.npmjs.org/">npm</a> (and <a href="http://bower.io/">bower</a>).
</li>
<li>Dependencies often depend on other dependencies, in both the Ruby and
JavaScript worlds. Imagine managing Ruby dependencies by hand.
</li>
<li>JavaScript modules often depend on either CommonJs or RequireJs being
available.
</li>
</ol>

<p>
(Side note: in terms of Node, a <code>module</code> is a special case of package that
JavaScript code can <code>require()</code>. For more info, see the <a href="https://www.npmjs.org/doc/misc/npm-faq.html">npm faq</a> and <a href="http://stackoverflow.com/questions/20008442/difference-between-a-module-and-a-package-in-node">Stack Overflow</a>).
</p>

<p>
Here's a good summary of other ways to handle the assets in a Rails app: <a href="http://www.codefellows.org/blog/five-ways-to-manage-front-end-assets-in-rails">Five Ways to Manage Front-End Assets in Rails</a>. I briefly tried those techniques, plus
the <a href="https://github.com/hsume2/browserify-rails">browserify-rails</a> gem. However, they seemed to conflict with the
<code>react-rails</code> gem, and if I didn't use that gem, I'd need a way to convert the
jsx into js files. This led me to try the webpack module bundler.
</p>

<p>
<a href="http://webpack.github.io/">{% img /images/2014-09-react-webpack-rails-tutorial/what-is-webpack.jpg %}</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Webpack</h2>
<div class="outline-text-2" id="text-2">
<p>
What's <a href="http://webpack.github.io/docs/what-is-webpack.html">Webpack</a>?
</p>

<blockquote>
<p>
webpack takes modules with dependencies and generates static assets representing those modules.
</p>
</blockquote>

<p>
Why did I try Webpack? It was recommended to me by <a href="http://2013.jsconf.eu/speakers/pete-hunt-react-rethinking-best-practices.html">Pete Hunt of the React team</a>.
Here's some solid reasons for "why Webpack":
</p>
<ol class="org-ol">
<li>Leverages npm (and optionally bower) for package management.
</li>
<li>Supports whatever module syntax you prefer.
</li>
<li>Has loaders (think pipeline), including ES6 and JSX.
</li>
<li>Its Webpack Dev Server rocks for quick prototypes (Hot Module Replacement) of JS and
CSS/Sass code.
</li>
</ol>

<p>
A good place to get started with Webpack is Pete Hunt's <a href="https://github.com/petehunt/webpack-howto">webpack-howto</a>.
</p>

<p>
I initially tried the <a href="http://webpack.github.io/">webpack module bundler</a> separate from Rails, as I wanted to
see the "hot reloading" of react code in action. You can try this sample code:
<a href="https://github.com/gaearon/react-tutorial-hot">react-tutorial-hot</a>. <a href="https://github.com/webpack/docs/wiki/hot-module-replacement-with-webpack">Hot module Replacement</a> changes the JS code (and possibly the
CSS) of the running code without any page refresh. Thus any data in the JS
objects sticks around! This is way cooler than <a href="http://livereload.com/">Live Reload</a>, which refreshes the
whole browser page.
</p>

<p>
Then I started using these features of Webpack:
</p>
<ol class="org-ol">
<li><a href="https://github.com/shama/es6-loader">es6-loader</a>, which incorporates both of the <a href="https://github.com/termi/es6-transpiler">es6-transpiler</a> and the
<a href="https://github.com/esnext/es6-module-transpiler">es6-module-transpiler</a>. For fun, try out the ES6 syntax with the <a href="http://www.es6fiddle.net/">ES6 Fiddle</a>.
Here's a <a href="https://github.com/lukehoban/es6features">great references on ES6 features</a>.
</li>
<li><a href="https://github.com/petehunt/jsx-loader">jsx-loader</a>, which handles jsx files using es6.
</li>
<li>Trivial integration of any additional packages available via <b><a href="https://www.npmjs.org/">npm</a></b> and the
ability to use whichever module syntax is most convenient.
</li>
</ol>

<p>
As Webpack generates a "bundle" that is not necessarily minified, it would seem
that this could be incorporated into the Rails asset pipeline, and sure enough,
it can be! This is well described in this article: <a href="https://medium.com/brigade-engineering/setting-up-webpack-with-rails-c62aea149679">Setting Up Webpack with Rails</a>
along with this example code to precompile with Webpack: <a href="http://www.tomdooner.com/2014/05/26/webpack.html">Webpack In The Rails Asset Pipeline</a>.
</p>

<p>
With the basic parts in place, I wanted achieve the following:
</p>
<ol class="org-ol">
<li>Be able to prototype client side JS using Webpack Dev Server (with hot module
replacement), while having this same code readily available in my Rails app.
This involves having JavaScript, Sass, and Image files commonly available to
both Rails and the Webpack Dev Server.
</li>
<li>Be able to easily deploy to Heroku.
</li>
</ol>

<p>
My solution to the problem is shown in this github repo:
<a href="https://github.com/justin808/react-webpack-rails-tutorial">justin808/react-webpack-rails-tutorial</a>. This is based on my tutorial using the
<code>react-rails</code> gem: <a href="https://github.com/justin808/react-rails-tutorial">Rails 4.2, React, completed tutorial</a>. I will now describe
this solution in detail. 
</p>
</div>
