source/org_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.org
** Setup
You'll need to install Node.js following. I'm assuming you already have Ruby and
Rails installed.
1. Node.js: You can find the [[http://nodejs.org/download/][Node.js download file here]]. Note, some friends of mine
   recommended the Node.js installer rather than using Brew. I did not try Brew.
2. Many articles recommend running the following command, so that you don't need
   to run node commands as sudo, thus changing the ownership of your /usr/local
   directory to yourself.
   #+BEGIN_SRC bash
   sudo chown -R $USER /usr/local
   #+END_SRC
3. Your =/package.json= file describes all other other dependencies, and running
   =npm install= will install everything required.

Once I got this working, it felt like Santa Clause came to my app with the whole
Node ecosystem!

[[http://webpack.github.io/][{% img /images/2014-09-react-webpack-rails-tutorial/npm-webpack-presents.jpg %}]]

** Bundler and Node Package Manager
All Rails developers are familiar with gems and [[http://bundler.io/][Bundler (bundle)]]. The equivalent for
Javascript are package.json files with [[https://www.npmjs.org/][Node Package Manager (npm)]] (see
discussion in next point on why not [[http://bower.io/][Bower]]).

Both of these package manager systems take care of retreiving dependencies from
reputable online sources. Using a =package.json= file is far superior to
manually downloading dependencies and copying the =/vendor/assets/= directory!

{% img /images/2014-09-react-webpack-rails-tutorial/bundle-npm.jpg %}

** Why NPM and not Bower for JS Assets?
The most popular equivalants for JavaScript are [[https://www.npmjs.org/][Node Package Manager (npm)]] and
[[http://bower.io/][Bower]]. For use with webpack, you'll want to prefer npm, per the reasons in the
[[http://webpack.github.io/docs/usage-with-bower.html][documentation]]:

#+begin_quote
In many cases modules from npm are better than the same module from bower. Bower
mostly contain only concatenated/bundled files which are:

- More difficult to handle for webpack
- More difficult to optimize for webpack
- Sometimes only useable without a module system

So prefer to use the CommonJs-style module and let webpack build it.
#+end_quote

** Webpack Plus Rails Solution Description
To integrate webpack with Rails, webpack is used in 2 ways:
1. Webpack is used soley within the =/webpack= directory in conjunction with the
   Webpack Dev Server to provide a rapid tool for prototyping the client side
   Javascript. The file =webpack.hot.config.js= sets up the JS and CSS assets
   for the Webpack Dev Server.
2. Webpack watches for changes and generates the =rails-bundle.js= file that
   bundles all the JavaScript referenced in the =/webpack/assets/javascripts=
   directory. The file =webpack.rails.config.js= converts the JSX files into JS
   files throught the JSX and ES6 transpilers. 

The following image describes the organization of integrating Webpack with Rails.
{% img /images/2014-09-react-webpack-rails-tutorial/webpack-rails-organization.jpg %}

| File                                           | Notes and Description                                                                                                                                        |
|------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------|
| =/app/assets/javascripts/rails-bundle.js=      | Output of =webpack --config webpack.rails.config.js=                                                                                                         |
| =/app/assets/javacripts/application.js=        | Add =rails-bundle= so webpack output included in sprockets                                                                                                   |
| =/app/assets/javascripts=                      | Do not include any files used by Webpack. Place those files in =/webpack/assets/javascripts=                                                                 |
| =/app/assets/stylesheets/application.css.scss= | Reference sass files in =/webpack/assets/stylesheets=                                                                                                        |
| =/node_modules=                                | Where npm puts the loaded packages                                                                                                                           |
| =/webpack=                                     | All webpack files under this directory except for node_modules and package.json                                                                              |
| =/webpack/assets/images=                       | =Symlink to /app/assets/images=. Needed so that Webpack Dev Server can see same images referenced by Rails sprockets                                         |
| =/webpack/assets/javascripts=                  | javascripts are packaged into rails-bundle.js as well as used by the Webpack Dev Server                                                                      |
| =/webpack/assets/stylesheets=                  | stylesheets are used by the asset pipeline (referenced directly by =/app/assets/stylesheets/application.css.scss=) as well as used by the Webpack Dev Server |
| =/webpack/index.html=                          | the default page loaded when testing the Webpack Dev Server                                                                                                  |
| =/webpack/scripts=                             | files used by only the Rails or Webpack Dev Server environments                                                                                              |
| =/webpack/server.js=                           | server.js is the code to configure the Webpack Dev Server                                                                                                    |
| =/webpack/webpack.hot.config.js=               | configures the webpack build for the Webpack Dev Server                                                                                                      |
| =/webpack/webpack.rails.config.js=             | configures web pack to generate the rails-bundle.js file                                                                                                     |
| =/.buildpacks=                                 | used to configure multiple node + ruby buildpacks for Heroku                                                                                                 |
| =/npm-shrinkwrap.json= and =/package.json=     | define the packages loaded by running 'npm install'                                                                                                          |
|------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------|

** webpack.config
To reiterate, we needed Webpack for the following reasons:
1. To enable the use of JS "modules", using either the either the [[http://requirejs.org/][AMD (aka require.js)]] or [[http://wiki.commonjs.org/wiki/Modules/1.1][CommonJs module syntax]].
2. To convert JSX files (ES6 and JSX syntax) into JS files. Note, you probably
   don't want to blindly convert all JS files into ES6, as that may conflict
   with some imported modules.

This setup with the =webpack.config= file. We need 2 versions of this file for
the two different needs, the Webpack Dev Sever and the Asset Pipeline.

{% img /images/2014-09-react-webpack-rails-tutorial/webpack-files.jpg %}

