source/_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.html
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Setup</h3>
<div class="outline-text-3" id="text-2-1">
<p>
You'll need to install Node.js following. I'm assuming you already have Ruby and
Rails installed.
</p>
<ol class="org-ol">
<li>Node.js: You can find the <a href="http://nodejs.org/download/">Node.js download file here</a>. Note, some friends of mine
recommended the Node.js installer rather than using Brew. I did not try Brew.
</li>
<li>Many articles recommend running the following command, so that you don't need
to run node commands as sudo, thus changing the ownership of your /usr/local
directory to yourself.
{% codeblock lang:bash %}
sudo chown -R $USER /usr/local
{% endcodeblock %}
</li>
<li>Your <code>/package.json</code> file describes all other other dependencies, and running
   <code>npm install</code> will install everything required.
</li>
</ol>

<p>
Once I got this working, it felt like Santa Clause came to my app with the whole
Node ecosystem!
</p>

<p>
<a href="http://webpack.github.io/">{% img /images/2014-09-react-webpack-rails-tutorial/npm-webpack-presents.jpg %}</a>
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Bundler and Node Package Manager</h3>
<div class="outline-text-3" id="text-2-2">
<p>
All Rails developers are familiar with gems and <a href="http://bundler.io/">Bundler (bundle)</a>. The equivalent for
Javascript are package.json files with <a href="https://www.npmjs.org/">Node Package Manager (npm)</a> (see
discussion in next point on why not <a href="http://bower.io/">Bower</a>).
</p>

<p>
Both of these package manager systems take care of retreiving dependencies from
reputable online sources. Using a <code>package.json</code> file is far superior to
manually downloading dependencies and copying the <code>/vendor/assets/</code> directory!
</p>

<p>
{% img /images/2014-09-react-webpack-rails-tutorial/bundle-npm.jpg %}
</p>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Why NPM and not Bower for JS Assets?</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The most popular equivalants for JavaScript are <a href="https://www.npmjs.org/">Node Package Manager (npm)</a> and
<a href="http://bower.io/">Bower</a>. For use with webpack, you'll want to prefer npm, per the reasons in the
<a href="http://webpack.github.io/docs/usage-with-bower.html">documentation</a>:
</p>

<blockquote>
<p>
In many cases modules from npm are better than the same module from bower. Bower
mostly contain only concatenated/bundled files which are:
</p>

<ul class="org-ul">
<li>More difficult to handle for webpack
</li>
<li>More difficult to optimize for webpack
</li>
<li>Sometimes only useable without a module system
</li>
</ul>

<p>
So prefer to use the CommonJs-style module and let webpack build it.
</p>
</blockquote>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Webpack Plus Rails Solution Description</h3>
<div class="outline-text-3" id="text-2-4">
<p>
To integrate webpack with Rails, webpack is used in 2 ways:
</p>
<ol class="org-ol">
<li>Webpack is used soley within the <code>/webpack</code> directory in conjunction with the
Webpack Dev Server to provide a rapid tool for prototyping the client side
Javascript. The file <code>webpack.hot.config.js</code> sets up the JS and CSS assets
for the Webpack Dev Server.
</li>
<li>Webpack watches for changes and generates the <code>rails-bundle.js</code> file that
bundles all the JavaScript referenced in the <code>/webpack/assets/javascripts</code>
directory. The file <code>webpack.rails.config.js</code> converts the JSX files into JS
files throught the JSX and ES6 transpilers. 
</li>
</ol>

<p>
The following image describes the organization of integrating Webpack with Rails.
{% img /images/2014-09-react-webpack-rails-tutorial/webpack-rails-organization.jpg %}
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">File</th>
<th scope="col" class="left">Notes and Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>/app/assets/javascripts/rails-bundle.js</code></td>
<td class="left">Output of <code>webpack --config webpack.rails.config.js</code></td>
</tr>

<tr>
<td class="left"><code>/app/assets/javacripts/application.js</code></td>
<td class="left">Add <code>rails-bundle</code> so webpack output included in sprockets</td>
</tr>

<tr>
<td class="left"><code>/app/assets/javascripts</code></td>
<td class="left">Do not include any files used by Webpack. Place those files in <code>/webpack/assets/javascripts</code></td>
</tr>

<tr>
<td class="left"><code>/app/assets/stylesheets/application.css.scss</code></td>
<td class="left">Reference sass files in <code>/webpack/assets/stylesheets</code></td>
</tr>

<tr>
<td class="left"><code>/node_modules</code></td>
<td class="left">Where npm puts the loaded packages</td>
</tr>

<tr>
<td class="left"><code>/webpack</code></td>
<td class="left">All webpack files under this directory except for node_modules and package.json</td>
</tr>

<tr>
<td class="left"><code>/webpack/assets/images</code></td>
<td class="left"><code>Symlink to /app/assets/images</code>. Needed so that Webpack Dev Server can see same images referenced by Rails sprockets</td>
</tr>

<tr>
<td class="left"><code>/webpack/assets/javascripts</code></td>
<td class="left">javascripts are packaged into rails-bundle.js as well as used by the Webpack Dev Server</td>
</tr>

<tr>
<td class="left"><code>/webpack/assets/stylesheets</code></td>
<td class="left">stylesheets are used by the asset pipeline (referenced directly by <code>/app/assets/stylesheets/application.css.scss</code>) as well as used by the Webpack Dev Server</td>
</tr>

<tr>
<td class="left"><code>/webpack/index.html</code></td>
<td class="left">the default page loaded when testing the Webpack Dev Server</td>
</tr>

<tr>
<td class="left"><code>/webpack/scripts</code></td>
<td class="left">files used by only the Rails or Webpack Dev Server environments</td>
</tr>

<tr>
<td class="left"><code>/webpack/server.js</code></td>
<td class="left">server.js is the code to configure the Webpack Dev Server</td>
</tr>

<tr>
<td class="left"><code>/webpack/webpack.hot.config.js</code></td>
<td class="left">configures the webpack build for the Webpack Dev Server</td>
</tr>

<tr>
<td class="left"><code>/webpack/webpack.rails.config.js</code></td>
<td class="left">configures web pack to generate the rails-bundle.js file</td>
</tr>

<tr>
<td class="left"><code>/.buildpacks</code></td>
<td class="left">used to configure multiple node + ruby buildpacks for Heroku</td>
</tr>

<tr>
<td class="left"><code>/npm-shrinkwrap.json</code> and <code>/package.json</code></td>
<td class="left">define the packages loaded by running 'npm install'</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">webpack.config</h3>
<div class="outline-text-3" id="text-2-5">
<p>
To reiterate, we needed Webpack for the following reasons:
</p>
<ol class="org-ol">
<li>To enable the use of JS "modules", using either the either the <a href="http://requirejs.org/">AMD (aka require.js)</a> or <a href="http://wiki.commonjs.org/wiki/Modules/1.1">CommonJs module syntax</a>.
</li>
<li>To convert JSX files (ES6 and JSX syntax) into JS files. Note, you probably
don't want to blindly convert all JS files into ES6, as that may conflict
with some imported modules.
</li>
</ol>

<p>
This setup with the <code>webpack.config</code> file. We need 2 versions of this file for
the two different needs, the Webpack Dev Sever and the Asset Pipeline.
</p>

<p>
{% img /images/2014-09-react-webpack-rails-tutorial/webpack-files.jpg %}
</p>
</div>
