source/org_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.org
*** Changing the webpack.config
You maybe wondering if you'll need to edit these webpack config files. Here's
some things you'll need to pay attention to.

1. *module.exports.entry*: The entry points will determine what webpack places
   in the bundle. While this may seem similar to the manifest file of
   =/app/assets/javascripts/application.js=, it's very different in that you
   /only/ need to specify the */entry/* points. So if you specify
   =./assets/javascripts/example= (you don't need the file suffix) is the entry
   point, then you do not and should not specify =./assets/javascripts/CommentBox=
   as an entry point. Once again, dependencies are calculated for Webpack,
   unlike Rails.
   #+BEGIN_SRC javascript
   module.exports = {
    context: __dirname,
    entry: [
      "./assets/javascripts/example"
    ], 
   
   #+END_SRC
2. *module.exports.externals*: If you want to load jQuery from a CDN or from the
   Rails gem, you might specify:
   #+BEGIN_SRC javascript
   module.exports.externals: {
     jquery: "var jQuery"
   },
   #+END_SRC 
3. *module.exports.module.loaders*: This is the place where you can expose
   jQuery from your Webpack rails-bundle.js so that the rest of the non-module
   using parts of Rails can use jQuery.
   #+BEGIN_SRC javascript
   module.exports.module: {
     loaders: [
       // Next 2 lines expose jQuery and $ to any JavaScript files loaded after rails-bundle.js
       //   in the Rails Asset Pipeline. Thus, load this one prior.
       { test: require.resolve("jquery"), loader: "expose?jQuery" },
       { test: require.resolve("jquery"), loader: "expose?$" }
     ]
   }
   #+END_SRC 

That being said, it's well worth familiarizing yourself with the [[http://webpack.github.io/docs/][documentation for webpack]]. 
The [[https://gitter.im/webpack/webpack][gitter room for webpack]] is also helpful.

** Webpack Dev Server and Hot Module Replacement
While waiting for webpack to create the rails-bundle.js file and then reloading
the Rails page is not terribly time consuming, there's *no comparison* to using
the [[http://webpack.github.io/docs/webpack-dev-server.html][Webpack Dev Server]] with [[https://github.com/webpack/docs/wiki/hot-module-replacement-with-webpack][Hot Module Replacement]] which loads new JavaScript
and Sass code without modifying the existing client side data if possible. If
you thought Live Reload was cool, you'll love this feature. To quote the
documentation:

#+begin_quote
The webpack-dev-server is a little node.js express server, which uses the
webpack-dev-middleware to serve a webpack bundle. It also has a little runtime
which is connected to the server via socket.io. The server emit information
about the compilation state to the client, which reacts on that events.

It serves static assets from the current directory. If the file isn’t found a
empty HTML page is generated whichs references the corresponding javascript
file.
#+end_quote

In a nutshell, the file =/webpack/server.js= is the http server utilizing the
[[http://webpack.github.io/docs/webpack-dev-server.html][Webpack Dev Server API]]:
1. =/webpack/webpack.hot.config.js= configures the webpack assets.
2. Has a couple of json responses.
3. Configures "hot" to be true to enable hot module replacement.
** JavaScripts
Webpack handles the following aspects of the =/webpack/assets/javascripts=
directory:
1. Preparing a "bundle" of the JavaScript files needed by either Rails or the
   Webpack Dev Server. This includes running the files through the jsx and es6
   loaders which transpile the jsx and es6 syntax into standard javascripts.
   Heres' the configuration that does the loading:
   #+BEGIN_SRC javascript
   module.loaders = [{ test: /\.jsx$/, loaders: ["react-hot", "es6", "jsx?harmony"] }]
   #+END_SRC
2. Webpack also normalizes whichever module loading syntax you choose
   (RequireJs, CommonJs, or ES6).   
** Sass and images
For the Webpack Dev Server build (not the Rails build that creates
=rails-bundle.js=), Sass is loaded via webpack for 2 reasons:
1. Webpack takes care of running the sass compiler.
2. Any changes made to sass or css files are loaded by the hot module loader
   into the browser.
The file =/webpack/scripts/webpack_only.jsx= contains this:
#+BEGIN_SRC javascript
require("test-stylesheet.css");
require("test-sass-stylesheet.scss");
#+END_SRC
This "requires" stylesheet information just like a "require" of JavaScript.
Thus, =/webpack/index.html= does not reference any output from the Sass
generation. This file, =webpack_only.jsx= is referenced only in the
=webpack.hot.config.js= file as an "entry point", which means that it gets
loaded explicitly in the created bundle file.

*Images* were a bit tricky, as during deployment, you want your images
fingerprinted for caching purposes. This is nearly invisible to users of newer
versions of the Rails, thanks to the [[http://guides.rubyonrails.org/asset_pipeline.html#what-is-fingerprinting-and-why-should-i-care-questionmark][fingerprinting feature of the Rails asset pipeline]]. 
While webpack can also fingerprint images, that's not needed as we're not
depending on this feature of webpack for our Rails deployments. So we just need
the Webpack Dev Server to access the same image files. I.e., we need to be able
to use a syntax in the =scss= files to reference images that works for both the
Webpack Dev Server as well as the Rails asset pipeline.


For example, here's a snippet of sass code to load the =twitter_64.png= image
from the top level of the =/app/assets/images= directory. This needs to work for
both the Asset Pipeline as well as the Webpack Dev Server.
#+BEGIN_SRC sass
.twitter-image {
  background-image: image-url('twitter_64.png');
}
#+END_SRC

The problem of how to get the same images into the stylesheets of both Rails and
Express server versions was solved by using a *symlink*, which git will
conveniently store.
1. =/webpack/assets/images= is a symlink for the =/app/assets/images= directory.
2. The =image-url= sass helper takes care of mapping the correct directories for
   images. The image directory for the webpack server is configured by this
   line:

   #+BEGIN_SRC javascript
   module.loaders = [{ test: /.scss$/, loader: “style!css!sass?outputStyle=expanded&imagePath=/assets/images”}]
   #+END_SRC
   The sass gem for rails handles the mapping for the Asset Pipeline.
3. The symlink was necessary, as the Webpack Dev Server could not reference files
   above the root directory.

This way the images are signed correctly for production builds via the Rails
asset pipeline, and the images work fine for the Webpack Dev Server.

