source/_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.html

<div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1">Changing the webpack.config</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
You maybe wondering if you'll need to edit these webpack config files. Here's
some things you'll need to pay attention to.
</p>

<ol class="org-ol">
<li><b>module.exports.entry</b>: The entry points will determine what webpack places
in the bundle. While this may seem similar to the manifest file of
<code>/app/assets/javascripts/application.js</code>, it's very different in that you
<i>only</i> need to specify the <b><i>entry</i></b> points. So if you specify
<code>./assets/javascripts/example</code> (you don't need the file suffix) is the entry
point, then you do not and should not specify <code>./assets/javascripts/CommentBox</code>
as an entry point. Once again, dependencies are calculated for Webpack,
unlike Rails.
{% codeblock lang:javascript %}
module.exports = {
 context: __dirname,
 entry: [
   "./assets/javascripts/example"
 ], 

{% endcodeblock %}
</li>
<li><b>module.exports.externals</b>: If you want to load jQuery from a CDN or from the
Rails gem, you might specify:
{% codeblock lang:javascript %}
module.exports.externals: {
  jquery: "var jQuery"
},
{% endcodeblock %}
</li>
<li><b>module.exports.module.loaders</b>: This is the place where you can expose
jQuery from your Webpack rails-bundle.js so that the rest of the non-module
using parts of Rails can use jQuery.
{% codeblock lang:javascript %}
module.exports.module: {
  loaders: [
    // Next 2 lines expose jQuery and $ to any JavaScript files loaded after rails-bundle.js
    //   in the Rails Asset Pipeline. Thus, load this one prior.
    { test: require.resolve("jquery"), loader: "expose?jQuery" },
    { test: require.resolve("jquery"), loader: "expose?$" }
  ]
}
{% endcodeblock %}
</li>
</ol>

<p>
That being said, it's well worth familiarizing yourself with the <a href="http://webpack.github.io/docs/">documentation for webpack</a>. 
The <a href="https://gitter.im/webpack/webpack">gitter room for webpack</a> is also helpful.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6">Webpack Dev Server and Hot Module Replacement</h3>
<div class="outline-text-3" id="text-2-6">
<p>
While waiting for webpack to create the rails-bundle.js file and then reloading
the Rails page is not terribly time consuming, there's <b>no comparison</b> to using
the <a href="http://webpack.github.io/docs/webpack-dev-server.html">Webpack Dev Server</a> with <a href="https://github.com/webpack/docs/wiki/hot-module-replacement-with-webpack">Hot Module Replacement</a> which loads new JavaScript
and Sass code without modifying the existing client side data if possible. If
you thought Live Reload was cool, you'll love this feature. To quote the
documentation:
</p>

<blockquote>
<p>
The webpack-dev-server is a little node.js express server, which uses the
webpack-dev-middleware to serve a webpack bundle. It also has a little runtime
which is connected to the server via socket.io. The server emit information
about the compilation state to the client, which reacts on that events.
</p>

<p>
It serves static assets from the current directory. If the file isn’t found a
empty HTML page is generated whichs references the corresponding javascript
file.
</p>
</blockquote>

<p>
In a nutshell, the file <code>/webpack/server.js</code> is the http server utilizing the
<a href="http://webpack.github.io/docs/webpack-dev-server.html">Webpack Dev Server API</a>:
</p>
<ol class="org-ol">
<li><code>/webpack/webpack.hot.config.js</code> configures the webpack assets.
</li>
<li>Has a couple of json responses.
</li>
<li>Configures "hot" to be true to enable hot module replacement.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7">JavaScripts</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Webpack handles the following aspects of the <code>/webpack/assets/javascripts</code>
directory:
</p>
<ol class="org-ol">
<li>Preparing a "bundle" of the JavaScript files needed by either Rails or the
Webpack Dev Server. This includes running the files through the jsx and es6
loaders which transpile the jsx and es6 syntax into standard javascripts.
Heres' the configuration that does the loading:
{% codeblock lang:javascript %}
module.loaders = [{ test: /\.jsx$/, loaders: ["react-hot", "es6", "jsx?harmony"] }]
{% endcodeblock %}
</li>
<li>Webpack also normalizes whichever module loading syntax you choose
(RequireJs, CommonJs, or ES6).   
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8">Sass and images</h3>
<div class="outline-text-3" id="text-2-8">
<p>
For the Webpack Dev Server build (not the Rails build that creates
<code>rails-bundle.js</code>), Sass is loaded via webpack for 2 reasons:
</p>
<ol class="org-ol">
<li>Webpack takes care of running the sass compiler.
</li>
<li>Any changes made to sass or css files are loaded by the hot module loader
into the browser.
</li>
</ol>
<p>
The file <code>/webpack/scripts/webpack_only.jsx</code> contains this:
</p>
{% codeblock lang:javascript %}
require("test-stylesheet.css");
require("test-sass-stylesheet.scss");
{% endcodeblock %}
<p>
This "requires" stylesheet information just like a "require" of JavaScript.
Thus, <code>/webpack/index.html</code> does not reference any output from the Sass
generation. This file, <code>webpack_only.jsx</code> is referenced only in the
<code>webpack.hot.config.js</code> file as an "entry point", which means that it gets
loaded explicitly in the created bundle file.
</p>

<p>
<b>Images</b> were a bit tricky, as during deployment, you want your images
fingerprinted for caching purposes. This is nearly invisible to users of newer
versions of the Rails, thanks to the <a href="http://guides.rubyonrails.org/asset_pipeline.html#what-is-fingerprinting-and-why-should-i-care-questionmark">fingerprinting feature of the Rails asset pipeline</a>. 
While webpack can also fingerprint images, that's not needed as we're not
depending on this feature of webpack for our Rails deployments. So we just need
the Webpack Dev Server to access the same image files. I.e., we need to be able
to use a syntax in the <code>scss</code> files to reference images that works for both the
Webpack Dev Server as well as the Rails asset pipeline.
</p>


<p>
For example, here's a snippet of sass code to load the <code>twitter_64.png</code> image
from the top level of the <code>/app/assets/images</code> directory. This needs to work for
both the Asset Pipeline as well as the Webpack Dev Server.
</p>
{% codeblock lang:sass %}
.twitter-image {
  background-image: image-url('twitter_64.png');
}
{% endcodeblock %}

<p>
The problem of how to get the same images into the stylesheets of both Rails and
Express server versions was solved by using a <b>symlink</b>, which git will
conveniently store.
</p>
<ol class="org-ol">
<li><code>/webpack/assets/images</code> is a symlink for the <code>/app/assets/images</code> directory.
</li>
<li>The <code>image-url</code> sass helper takes care of mapping the correct directories for
images. The image directory for the webpack server is configured by this
line:

{% codeblock lang:javascript %}
module.loaders = [{ test: /.scss$/, loader: “style!css!sass?outputStyle=expanded&imagePath=/assets/images”}]
{% endcodeblock %}
<p>
The sass gem for rails handles the mapping for the Asset Pipeline.
</p>
</li>
<li>The symlink was necessary, as the Webpack Dev Server could not reference files
above the root directory.
</li>
</ol>

<p>
This way the images are signed correctly for production builds via the Rails
asset pipeline, and the images work fine for the Webpack Dev Server.
</p>
</div>
</div>
