source/org_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.org
** Sourcemaps
When debugging JavaScript using the Rails app, I did not want to have to scroll
through a giant =rails-bundle.js= of all js assets. Sourcemap support in Webpack
addressed that issue. At first I tried to use plain sourcemaps (separate file
rather than integrated), but that resulted in an off by one error. Furthermore,
I had to do [[https://github.com/justin808/react-webpack-rails-tutorial/blob/3aa3cd112453ce436b942c45bb3b906458532b89/webpack/webpack.rails.config.js][some fancy work to move the created file to the correct spot]] of
=/public/assets=. Also note that building the sourcemap file when deploying to
Heroku breaks the Heroku build. Both of these cases are handled at the bottom of
the file =webpack.rails.config.js=.

This is what sourcemaps looks like in Chrome
{% img /images/2014-09-react-webpack-rails-tutorial/React-Sourcemaps.jpg %}

** Heroku Deployment
There are several things needed to get builds working on Heroku.
1. It's critical that =package.json= has all tools required by the Heroku build
   in =dependencies= and /not/ =devDependencies= as Heroku only installs those
   modules in =dependencies=. You should use =devDependencies= for tools that
   *only* your local Webpack Dev Server uses.
2. Clean up your build cache:
   #+BEGIN_SRC bash
   heroku plugins:install https://github.com/heroku/heroku-repo.git
   heroku repo:purge_cache -a <my-app> 
   #+END_SRC
3. Be sure to run npm-shrinkwrap after *ANY* changes to =dependencies= inside of
   =package.json=.
4. I needed to configure the =compile_environment= task to create the =rails-bundle.js= via
   Webpack using the file =/lib/tasks/assets.rake=.
5. Heroku needs both the node and ruby environments. In order to deploy to
   heroku, you’ll need run this command once to set a custom buildpack:

#+BEGIN_SRC bash
heroku config:add BUILDPACK_URL=https://github.com/ddollar/heroku-buildpack-multi.git
#+END_SRC

This runs the two buildpacks in the =/.buildpacks= file courtesy of the
[[https://github.com/ddollar/heroku-buildpack-multi][ddollar/heroku-buildpack-multi]] buildpack.

** Why node_modules and package.json are not in the webpack directory?
While it would be tidier to put =node_modules= and =package.json= into the
=/webpack= directory, the problem is that this would require a custom buildpack
for installing the node_modules on Heroku.
** Why Have a Second Assets Directory Under Webpack?
At first, I had Webpack reference the JSX files from the
=/app/assets/javascripts directory=. However, I wanted to be able to use a
[[http://www.jetbrains.com/webstorm/][WebStorm]] project just based on the JavaScript code. I'd either have to put the
WebStorm project at the root level, thus including all the Ruby directories, or
I could use a sym link to the =javascripts= directory. You *NEVER* want run two
different JetBrains products simultaneously on the same directory, so that ruled
out using WebStorm at the top of my Rails app. The symlink approach seemed to
work, but that got confusing especially given I'd sometimes open the JSX files
in Emacs.

The approach of putting the webpack bundled assets under the =/webpack/assets=
directory worked out well for me. It seems natural that Webpack bundles those
assets and puts them into the =rails-bundle.js= file in the
=/app/assets/javascripts= directory.

For the same reasons, I'm keeping style sheets referenced by Webpack under the
=/webpack= directory. Note, I'm using Webpack to load stylesheets, as that
allows the style sheet changes to be hot loaded into the browser! If you edit any
of the files in the =/webpack/assets/stylesheets= directory, you'll see the
browser update with the style changes almost immediately after you hit save. The
standard Rails file =/app/assets/stylesheets/application.css.scss= references
the file style sheets in =/webpack/assets/stylesheets=.

** How to Add a NPM (JavaScript) module dependency?
This is a bit like modifying your Gemfile with a new gem dependency.
1. Modify your =/package.json= file with the appropriate line for the desired
   package inside the "dependencies" section. You'll want to specify an exact
   version, as that's the recommendation in the Node community. Just google "npm
   <whatever module>" and you'll get a link to the npm page for that module
   where you can see the version. For example, to add =marked= as a dependency,
   I added this line to =package.json=.
   #+BEGIN_SRC javascript
   "marked": "^0.3.2",
   #+END_SRC
2. Include the appropriate line to require the module. For example, to include
   the =marked= library:
   #+BEGIN_SRC javascript
   var marked = require("marked");
   #+END_SRC

** How to update Node Dependencies
When you're ready to take the time to ensure that upgrading your packages will
not break your code, you'll want to take the following steps. Refer to [[https://www.npmjs.org/package/npm-check-updates][npm-check-updates]]
and [[https://www.npmjs.org/doc/cli/npm-shrinkwrap.html][npm-shrinkwrap]].
#+BEGIN_SRC bash
cd <top level of your app>
rm -rf node_modules
npm install -g npm-check-updates
npm-check-updates -u
npm install 
npm-shrinkwrap
#+END_SRC

* Rapid Client Development
Congratulations! You've gotten through what I believe is the secret sauce for
rapid client side JavaScript development. Once you get the setup, per the above
steps, the flow goes like this: 
1. Run the Webpack Dev Server on port 3000 
    #+BEGIN_SRC bash
    cd webpack && node server.js
    #+END_SRC 
2. Point your browser at [[http://0.0.0.0:3000]].
3. Start another shell and run
    #+BEGIN_SRC bash
    foreman start -f Procfile.dev
    #+END_SRC
4. Point your browser at [[http://0.0.0.0:4000]] and verify you can see the usage of
   the rails-bundle.js file.
5. Update the =jsx= and =scss= files under =/webpack/assets= and see the browser
   at port 3000 update when files are saved.
6. Start with static data in the JSX creation, and then move to having the
   =server.js= file vend JSON to the client.
7. Once that works, have the rails server create the JSON.
8. Deploy to Heroku!
9. Prosper!

* Links
1. Github repo for this code: [[https://github.com/justin808/react-webpack-rails-tutorial][justin808/react-webpack-rails-tutorial]]
2. Live version of this code on Heroku: http://react-webpack-rails-tutorial.herokuapp.com/ 
3. [[http://www.railsonmaui.com/blog/2014/09/28/storing-or-excluding-node-modules-in-rails-git-repositories/][Storing or Excluding Node Modules in Rails Git Repositories]]?
4. Pete Hunt's [[https://github.com/petehunt/webpack-howto][introductory guide to getting started with Webpack]].

