source/_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.html
<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9">Sourcemaps</h3>
<div class="outline-text-3" id="text-2-9">
<p>
When debugging JavaScript using the Rails app, I did not want to have to scroll
through a giant <code>rails-bundle.js</code> of all js assets. Sourcemap support in Webpack
addressed that issue. At first I tried to use plain sourcemaps (separate file
rather than integrated), but that resulted in an off by one error. Furthermore,
I had to do <a href="https://github.com/justin808/react-webpack-rails-tutorial/blob/3aa3cd112453ce436b942c45bb3b906458532b89/webpack/webpack.rails.config.js">some fancy work to move the created file to the correct spot</a> of
<code>/public/assets</code>. Also note that building the sourcemap file when deploying to
Heroku breaks the Heroku build. Both of these cases are handled at the bottom of
the file <code>webpack.rails.config.js</code>.
</p>

<p>
This is what sourcemaps looks like in Chrome
{% img /images/2014-09-react-webpack-rails-tutorial/React-Sourcemaps.jpg %}
</p>
</div>
</div>
<div id="outline-container-sec-2-10" class="outline-3">
<h3 id="sec-2-10">Heroku Deployment</h3>
<div class="outline-text-3" id="text-2-10">
<p>
There are several things needed to get builds working on Heroku.
</p>
<ol class="org-ol">
<li>It's critical that <code>package.json</code> has all tools required by the Heroku build
in <code>dependencies</code> and <i>not</i> <code>devDependencies</code> as Heroku only installs those
modules in <code>dependencies</code>. You should use <code>devDependencies</code> for tools that
<b>only</b> your local Webpack Dev Server uses.
</li>
<li>Clean up your build cache:
{% codeblock lang:bash %}
heroku plugins:install https://github.com/heroku/heroku-repo.git
heroku repo:purge_cache -a <my-app> 
{% endcodeblock %}
</li>
<li>Be sure to run npm-shrinkwrap after <b>ANY</b> changes to <code>dependencies</code> inside of
   <code>package.json</code>.
</li>
<li>I needed to configure the <code>compile_environment</code> task to create the <code>rails-bundle.js</code> via
Webpack using the file <code>/lib/tasks/assets.rake</code>.
</li>
<li>Heroku needs both the node and ruby environments. In order to deploy to
heroku, you’ll need run this command once to set a custom buildpack:
</li>
</ol>

{% codeblock lang:bash %}
heroku config:add BUILDPACK_URL=https://github.com/ddollar/heroku-buildpack-multi.git
{% endcodeblock %}

<p>
This runs the two buildpacks in the <code>/.buildpacks</code> file courtesy of the
<a href="https://github.com/ddollar/heroku-buildpack-multi">ddollar/heroku-buildpack-multi</a> buildpack.
</p>
</div>
</div>
<div id="outline-container-sec-2-11" class="outline-3">
<h3 id="sec-2-11">Why node_modules and package.json are not in the webpack directory?</h3>
<div class="outline-text-3" id="text-2-11">
<p>
While it would be tidier to put <code>node_modules</code> and <code>package.json</code> into the
<code>/webpack</code> directory, the problem is that this would require a custom buildpack
for installing the node_modules on Heroku.
</p>
</div>
</div>

<div id="outline-container-sec-2-12" class="outline-3">
<h3 id="sec-2-12">Why Have a Second Assets Directory Under Webpack?</h3>
<div class="outline-text-3" id="text-2-12">
<p>
At first, I had Webpack reference the JSX files from the
<code>/app/assets/javascripts directory</code>. However, I wanted to be able to use a
<a href="http://www.jetbrains.com/webstorm/">WebStorm</a> project just based on the JavaScript code. I'd either have to put the
WebStorm project at the root level, thus including all the Ruby directories, or
I could use a sym link to the <code>javascripts</code> directory. You <b>NEVER</b> want run two
different JetBrains products simultaneously on the same directory, so that ruled
out using WebStorm at the top of my Rails app. The symlink approach seemed to
work, but that got confusing especially given I'd sometimes open the JSX files
in Emacs.
</p>

<p>
The approach of putting the webpack bundled assets under the <code>/webpack/assets</code>
directory worked out well for me. It seems natural that Webpack bundles those
assets and puts them into the <code>rails-bundle.js</code> file in the
<code>/app/assets/javascripts</code> directory.
</p>

<p>
For the same reasons, I'm keeping style sheets referenced by Webpack under the
<code>/webpack</code> directory. Note, I'm using Webpack to load stylesheets, as that
allows the style sheet changes to be hot loaded into the browser! If you edit any
of the files in the <code>/webpack/assets/stylesheets</code> directory, you'll see the
browser update with the style changes almost immediately after you hit save. The
standard Rails file <code>/app/assets/stylesheets/application.css.scss</code> references
the file style sheets in <code>/webpack/assets/stylesheets</code>.
</p>
</div>
</div>
<div id="outline-container-sec-2-13" class="outline-3">
<h3 id="sec-2-13">How to Add a NPM (JavaScript) module dependency?</h3>
<div class="outline-text-3" id="text-2-13">
<p>
This is a bit like modifying your Gemfile with a new gem dependency.
</p>
<ol class="org-ol">
<li>Modify your <code>/package.json</code> file with the appropriate line for the desired
package inside the "dependencies" section. You'll want to specify an exact
version, as that's the recommendation in the Node community. Just google "npm
&lt;whatever module&gt;" and you'll get a link to the npm page for that module
where you can see the version. For example, to add <code>marked</code> as a dependency,
I added this line to <code>package.json</code>.
{% codeblock lang:javascript %}
"marked": "^0.3.2",
{% endcodeblock %}
</li>
<li>Include the appropriate line to require the module. For example, to include
the <code>marked</code> library:
{% codeblock lang:javascript %}
var marked = require("marked");
{% endcodeblock %}
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-14" class="outline-3">
<h3 id="sec-2-14">How to update Node Dependencies</h3>
<div class="outline-text-3" id="text-2-14">
<p>
When you're ready to take the time to ensure that upgrading your packages will
not break your code, you'll want to take the following steps. Refer to <a href="https://www.npmjs.org/package/npm-check-updates">npm-check-updates</a>
and <a href="https://www.npmjs.org/doc/cli/npm-shrinkwrap.html">npm-shrinkwrap</a>.
</p>
{% codeblock lang:bash %}
cd <top level of your app>
rm -rf node_modules
npm install -g npm-check-updates
npm-check-updates -u
npm install 
npm-shrinkwrap
{% endcodeblock %}
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Rapid Client Development</h2>
<div class="outline-text-2" id="text-3">
<p>
Congratulations! You've gotten through what I believe is the secret sauce for
rapid client side JavaScript development. Once you get the setup, per the above
steps, the flow goes like this: 
</p>
<ol class="org-ol">
<li>Run the Webpack Dev Server on port 3000 
{% codeblock lang:bash %}
cd webpack && node server.js
{% endcodeblock %}
</li>
<li>Point your browser at <a href="http://0.0.0.0:3000">http://0.0.0.0:3000</a>.
</li>
<li>Start another shell and run
{% codeblock lang:bash %}
foreman start -f Procfile.dev
{% endcodeblock %}
</li>
<li>Point your browser at <a href="http://0.0.0.0:4000">http://0.0.0.0:4000</a> and verify you can see the usage of
the rails-bundle.js file.
</li>
<li>Update the <code>jsx</code> and <code>scss</code> files under <code>/webpack/assets</code> and see the browser
at port 3000 update when files are saved.
</li>
<li>Start with static data in the JSX creation, and then move to having the
   <code>server.js</code> file vend JSON to the client.
</li>
<li>Once that works, have the rails server create the JSON.
</li>
<li>Deploy to Heroku!
</li>
<li>Prosper!
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Links</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Github repo for this code: <a href="https://github.com/justin808/react-webpack-rails-tutorial">justin808/react-webpack-rails-tutorial</a>
</li>
<li>Live version of this code on Heroku: <a href="http://react-webpack-rails-tutorial.herokuapp.com/">http://react-webpack-rails-tutorial.herokuapp.com/</a> 
</li>
<li><a href="http://www.railsonmaui.com/blog/2014/09/28/storing-or-excluding-node-modules-in-rails-git-repositories/">Storing or Excluding Node Modules in Rails Git Repositories</a>?
</li>
<li>Pete Hunt's <a href="https://github.com/petehunt/webpack-howto">introductory guide to getting started with Webpack</a>.
</li>
</ol>
</div>
</div>
