source/org_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.org
* Acknowledgments
This work was inspired by a project for my client, [[http://madroneco.com/][Madrone Inc.]]. The founder
clearly desired a UI that did not fit into the standard request/response HTML of
Rails. If you want to work with me on this project, or other related projects,
please [[mailto:justin@railsonmaui.com][email me]].

I'd like to thank the following reviewers: Ed Roman, [[https://twitter.com/ed_roman][@ed_roman]], Greg Lazarev,
[[https://twitter.com/gylaz][@gylaz]], Geoff Evason, [[https://twitter.com/gevason][@gevason]], Jose Luis Torres, [[https://twitter.com/joseluis_torres][@joseluis_torres]], Mike
Kazmier, [[https://twitter.com/Kaztopia][@Kaztopia]], John Lynch, [[https://twitter.com/johnrlynch][@johnrlynch]], Jonathan Soeder, [[https://twitter.com/soederpop][@soederpop]], and
Ben Ward, [[https://twitter.com/mauilabs][@mauilabs]].

Comments, suggestions, and corrections are appreciated! I hope to get a lively
discussion the use of WebPack and Rails in my new discussion forum at
http://forum.shakacode.com.

Thanks to Hack Hands for supporting the development of this content. You can
find [[https://hackhands.com/fast-rich-client-rails-development-webpack-es6-transpiler/][a copy of this article in their blog]]. 
* Updates
1. 2014-09-22: Updated the Heroku Deployment section, including how =dependencies=
   vs. =devDependencies= in =package.json=.
