source/_posts/2014-09-25-integrating-webpack-and-the-es6-transpiler-into-an-existing-rails-project.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Acknowledgments</h2>
<div class="outline-text-2" id="text-5">
<p>
This work was inspired by a project for my client, <a href="http://madroneco.com/">Madrone Inc.</a>. The founder
clearly desired a UI that did not fit into the standard request/response HTML of
Rails. If you want to work with me on this project, or other related projects,
please <a href="mailto:justin@railsonmaui.com">email me</a>.
</p>

<p>
I'd like to thank the following reviewers: Ed Roman, <a href="https://twitter.com/ed_roman">@ed_roman</a>, Greg Lazarev,
<a href="https://twitter.com/gylaz">@gylaz</a>, Geoff Evason, <a href="https://twitter.com/gevason">@gevason</a>, Jose Luis Torres, <a href="https://twitter.com/joseluis_torres">@joseluis_torres</a>, Mike
Kazmier, <a href="https://twitter.com/Kaztopia">@Kaztopia</a>, John Lynch, <a href="https://twitter.com/johnrlynch">@johnrlynch</a>, Jonathan Soeder, <a href="https://twitter.com/soederpop">@soederpop</a>, and
Ben Ward, <a href="https://twitter.com/mauilabs">@mauilabs</a>.
</p>

<p>
Comments, suggestions, and corrections are appreciated! I hope to get a lively
discussion the use of WebPack and Rails in my new discussion forum at
<a href="http://forum.railsonmaui.com">http://forum.railsonmaui.com</a>.
</p>

<p>
Thanks to Hack Hands for supporting the development of this content. You can
find <a href="https://hackhands.com/fast-rich-client-rails-development-webpack-es6-transpiler/">a copy of this article in their blog</a>. 
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Updates</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>2014-09-22: Updated the Heroku Deployment section, including how <code>dependencies</code>
vs. <code>devDependencies</code> in <code>package.json</code>.
</li>
</ol>
</div>
</div>
